#### ElementMulticategoryFilter Constructor (ICollection(BuiltInCategory))

---

|  |
| --- |
| ElementMulticategoryFilter Class   See Also |

Constructs a new instance of a filter to match elements by built-in category.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementMulticategoryFilter( 	ICollection<BuiltInCategory> categories ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	categories As ICollection(Of BuiltInCategory) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ElementMulticategoryFilter( 	ICollection<BuiltInCategory>^ categories ) ``` |

#### Parameters

categories
:   Type:  System.Collections.Generic ICollection   BuiltInCategory
     The built-in categories to match.

# See Also

ElementMulticategoryFilter Class

ElementMulticategoryFilter Overload

Autodesk.Revit.DB Namespace